TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/Enums/НастройкиПользователя/НастройкиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиПользователя</name>
  <enumValues>
    <name>ВидАдресаПодключенияWS</name>
  </enumValues>
  <enumValues>
    <name>ЕГАИСПериодСпискаТТН</name>
  </enumValues>
  <enumValues>
    <name>ЖурналПродажиАлкогольнойПродукцииВыводитьТитульныйЛист</name>
  </enumValues>
  <enumValues>
    <name>ЖурналПродажиАлкогольнойПродукцииПериод</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаВариантПоиска</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаГруппа</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаЕдИзм</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаПутьКФайлу</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаСтавкаНДС</name>
  </enumValues>
  <enumValues>
    <name>КассаВозвратРазвернуто</name>
  </enumValues>
  <enumValues>
    <name>КассаПродажаРазвернуто</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтчетГеоВариант</name>
    <comment>0 - ПоКассовойСмене, 1 -  </comment>
  </enumValues>
  <enumValues>
    <name>ОтчетГеоПериод</name>
  </enumValues>
  <enumValues>
    <name>ОтчетГеоПоГоризонтали</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиВариант</name>
    <comment>0 - ПоКассовойСмене, 1 -  </comment>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиПериод</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиПоГоризонтали</name>
  </enumValues>
  <enumValues>
    <name>ПериодСпискаЧеков</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровВариантСортировки</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровИзбранное</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровОтборПоГруппеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровОтборПоГруппеФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровПоискПоШтрихкодуВручнуюФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистВариантСортировки</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистИзбранное</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистОтборПоГруппеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистОтборПоГруппеФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистПоискПоШтрихкодуВручнуюФлаг</name>
  </enumValues>
  <enumValues>
    <name>ФильтрСпискаЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткиЦенникиРежимПечати</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/DataProcessors/ПанельМеню/Forms/ПрайсЛист/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Штрихкод = ПолученныйШтрихкод;
	ПоискПоШтрихкодуВручнуюФлаг = Истина;
	УстановитьВидимостьПоискПоШтрихкодуВручную();
	
	ОбщегоНазначенияКлиентСервер.УдалитьГруппуОтбораСписка(СписокПрайсЛист, "ПоискШтрихкоду");
	ПоискПоШтрихкодуНаСервере();
	
КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ОбновитьИндексПолнотекстовогоПоиска();
	
	ОбщегоНазначения.ОформитьСуммовыеПоля(ЭтаФорма, "СписокПрайсЛистЦена");
	
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ПрайсЛистОтборПоГруппеФлаг, ОтборПоГруппеФлаг);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ПрайсЛистОтборПоГруппеЗначение, ОтборГруппа);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ПрайсЛистПоискПоШтрихкодуВручнуюФлаг, ПоискПоШтрихкодуВручнуюФлаг);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ПрайсЛистИзбранное, Избранное);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ПрайсЛистВариантСортировки, ВариантСортировки);
	
	Если Параметры.Свойство("ДобавлениеШтрихкодаВПрайсЛист") Тогда
		ШтрихкодДобавленияВПрайсЛист = Параметры.Штрихкод;
		ДобавлениеШтрихкодаВПрайсЛист = Истина;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокПрайсЛист,
		"Группа",
		ОтборГруппа,
		ЗначениеЗаполнено(ОтборГруппа),
		ВидСравненияКомпоновкиДанных.ВИерархии);
	
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокПрайсЛист,
		"Избранное",
		Избранное,
		Избранное,
		ВидСравненияКомпоновкиДанных.Равно);
	
	УстановитьВидимостьПоискПоШтрихкодуВручную();
	
	УстановитьПорядокПрайсЛиста();
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" ИЛИ ИмяСобытия = "ВыполненОбмен" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	ИначеЕсли ИмяСобытия = "ЗаписанТовар" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Элементы.СписокПрайсЛист.ТекущаяСтрока = Параметр;
			ПоследнийИзмененныйТовар = Параметр;
			
			ИнтервалСек = 5;
			ПодключитьОбработчикОжидания("Подключаемый_ОчиститьПоследнийИзмененныйТовар", ИнтервалСек);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ПрайсЛистОтборПоГруппеФлаг",     ОтборПоГруппеФлаг);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ПрайсЛистОтборПоГруппеЗначение", ОтборГруппа);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ПрайсЛистИзбранное",             Избранное);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ПрайсЛистВариантСортировки",     ВариантСортировки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокПрайсЛист,
		"Избранное",
		Избранное,
		Избранное,
		ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборГруппаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокПрайсЛист,
		"Группа",
		ОтборГруппа,
		ЗначениеЗаполнено(ОтборГруппа),
		ВидСравненияКомпоновкиДанных.ВИерархии);
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УдалитьГруппуОтбораСписка(СписокПрайсЛист, "ПоискШтрихкоду");
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УдалитьГруппуОтбораСписка(СписокПрайсЛист, "ПоискШтрихкоду");
	ПоискПоШтрихкодуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПрайсЛистВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокПрайсЛист.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);

	
	Если ДобавлениеШтрихкодаВПрайсЛист Тогда
	
		
		ПараметрыФормы.Вставить("ДобавлениеШтрихкодаВПрайсЛист");
		ПараметрыФормы.Вставить("Штрихкод", ШтрихкодДобавленияВПрайсЛист);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеДобавлениеШтрихкодаВПрайсЛист", ЭтотОбъект);
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",
		ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПрайсЛистПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если ДобавлениеШтрихкодаВПрайсЛист Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДобавлениеШтрихкодаВПрайсЛист");
		ПараметрыФормы.Вставить("Штрихкод", ШтрихкодДобавленияВПрайсЛист);
		
		Если Копирование Тогда
			
			ТекущиеДанные = Элементы.СписокПрайсЛист.ТекущиеДанные;
			
			Если ТекущиеДанные = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы.Вставить("Основание", ТекущиеДанные.Ссылка);
			
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеДобавлениеШтрихкодаВПрайсЛист", ЭтотОбъект);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Родитель", ОтборГруппа);
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Основание", СтруктураПараметры);
		ДанныеЗаполнения.Вставить("Штрихкод", Штрихкод);
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ДанныеЗаполнения, ЭтаФорма);
		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	Если ДобавлениеШтрихкодаВПрайсЛист Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДобавлениеШтрихкодаВПрайсЛист");
		ПараметрыФормы.Вставить("Штрихкод", ШтрихкодДобавленияВПрайсЛист);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеДобавлениеШтрихкодаВПрайсЛист", ЭтотОбъект);
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Родитель", ОтборГруппа);
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Основание", СтруктураПараметры);
		ДанныеЗаполнения.Вставить("Штрихкод", Штрихкод);
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ДанныеЗаполнения, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоГруппеТоваров(Команда)
	
	ОтборПоГруппеФлаг = НЕ ОтборПоГруппеФлаг;
	УстановитьВидимостьОтборПоГруппе();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуВручную(Команда)
	
	ПоискПоШтрихкодуВручнуюФлаг = НЕ ПоискПоШтрихкодуВручнуюФлаг;
	УстановитьВидимостьПоискПоШтрихкодуВручную();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоШтрихкоду(Команда)
	
	ОбщегоНазначенияКлиентСервер.УдалитьГруппуОтбораСписка(СписокПрайсЛист, "ПоискШтрихкоду");
	ПоискПоШтрихкодуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуСканером(Команда)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	
	ОбработчикЗакрытияСканирования = Новый ОписаниеОповещения("ОбработкаЗакрытияСканирования", ЭтотОбъект, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	
	Список = Новый СписокЗначений;
	Список.Добавить("НаимВозр", "Наименование: А -> Я",, БиблиотекаКартинок.СортироватьСписокПоВозрастанию);
	Список.Добавить("НаимУбыв", "Наименование: Я -> А",, БиблиотекаКартинок.СортироватьСписокПоУбыванию);
	Список.Добавить("ЦенаВозр", "Цена: возрастание",,    БиблиотекаКартинок.СортироватьПоВозрастаниюБелый);
	Список.Добавить("ЦенаУбыв", "Цена: убывание",,       БиблиотекаКартинок.СортироватьПоУбываниюБелый);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюСортировать", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.Сортировать);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПорядокПрайсЛиста()
	
	Если ПустаяСтрока(ВариантСортировки) Тогда
		ВариантСортировки = "НаимВозр";
	КонецЕсли;
	
	Если ВариантСортировки = "НаимВозр" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПорядокСписка(СписокПрайсЛист, "Наименование",
			НаправлениеСортировкиКомпоновкиДанных.Возр);
		Элементы.Сортировать.Картинка = БиблиотекаКартинок.СортироватьСписокПоВозрастанию;
		
	ИначеЕсли ВариантСортировки = "НаимУбыв" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПорядокСписка(СписокПрайсЛист, "Наименование",
			НаправлениеСортировкиКомпоновкиДанных.Убыв);
		Элементы.Сортировать.Картинка = БиблиотекаКартинок.СортироватьСписокПоУбыванию;
		
	ИначеЕсли ВариантСортировки = "ЦенаВозр" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПорядокСписка(СписокПрайсЛист, "Цена",
			НаправлениеСортировкиКомпоновкиДанных.Возр);
		Элементы.Сортировать.Картинка = БиблиотекаКартинок.СортироватьПоВозрастанию;
		
	ИначеЕсли ВариантСортировки = "ЦенаУбыв" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПорядокСписка(СписокПрайсЛист, "Цена",
			НаправлениеСортировкиКомпоновкиДанных.Убыв);
		Элементы.Сортировать.Картинка = БиблиотекаКартинок.СортироватьПоУбыванию;
		
	КонецЕсли;
	
	Элементы.СписокПрайсЛист.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМенюСортировать(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантСортировки = Результат.Значение;
	УстановитьПорядокПрайсЛиста();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеДобавлениеШтрихкодаВПрайсЛист(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПоискПоШтрихкодуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
		
	СписокНоменклатуры = ОбработкаТабличнойЧастиВызовСервера.НайтиПоШтрихКодуПодобно(Штрихкод);
	
	ПоискШтрихкоду = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		СписокПрайсЛист.Отбор.Элементы,
		"ПоискШтрихкоду",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораГруппыСписка(
		ПоискШтрихкоду,
		"Ссылка",
		СписокНоменклатуры,
		Истина,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтборПоГруппе()
	
	ОбщегоНазначения.УстановитьПометкуКнопки(ЭтаФорма, "ОтборПоГруппеТоваров", ОтборПоГруппеФлаг);
	Элементы.ОтборПоГруппе.Видимость = ОтборПоГруппеФлаг;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоискПоШтрихкодуВручную()
	
	ОбщегоНазначения.УстановитьПометкуКнопки(ЭтаФорма, "ПоискПоШтрихкодуВручную", ПоискПоШтрихкодуВручнуюФлаг);
	Элементы.ГруппаПоискПоШтрихкоду.Видимость = ПоискПоШтрихкодуВручнуюФлаг;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИзбранное", "Видимость", ЗначениеНастроекПовтИсп.ИспользуютсяИзбранныеТовары());
	
	ИспользуютсяШтрихкоды = ЗначениеНастроекПовтИсп.ИспользуютсяШтрихкоды();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПоискПоШтрихкоду", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров() 
		И НЕ ИспользуетсяАсинхронныйСканер
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПоискПоШтрихкодуВручную", "Видимость",
		ИспользуютсяШтрихкоды);
	
	ИспользуютсяГруппы = ЗначениеНастроекПовтИсп.ИспользуютсяГруппыНоменклатуры();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ОтборПоГруппеТоваров, ОтборПоГруппе", "Видимость", ИспользуютсяГруппы);
	УстановитьВидимостьОтборПоГруппе();
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СоздатьПлюс, МенюСкопировать, МенюПереместитьВГруппу", "Видимость", ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	
	Если ДобавлениеШтрихкодаВПрайсЛист Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "МенюПереместитьВГруппу", "Видимость",
			Ложь);
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, "СписокПрайсЛистНаименование");
	
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьПоследнийИзмененныйТовар()
	
	ПоследнийИзмененныйТовар = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти
